t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
      <!-- *************************  Device 'STM32L151RE'  ***************************** -->
      <device Dname="STM32L151RE">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_XL"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x4000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_512_OPT.FLM" start="0x1FF80000" size="0x0028"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00098321.pdf"             title="STM32L15xxE, Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="21"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="LCD"           n="1"       m="4.32"/>
        <feature type="LCD"           n="1"       m="8.28"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32L151VE'  ***************************** -->
      <device Dname="STM32L151VE">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_XL"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x4000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_512_OPT.FLM" start="0x1FF80000" size="0x0028"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00098321.pdf"             title="STM32L15xxE, Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="25"      m="12"/>
        <feature type="IOs"           n="83"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="QFP"           n="100"/>
        <feature type="CSP"           n="104"/>
      </device>
      
      <!-- *************************  Device 'STM32L151ZE'  ***************************** -->
      <device Dname="STM32L151ZE">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_XL"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x4000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_512_OPT.FLM" start="0x1FF80000" size="0x0028"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00098321.pdf"             title="STM32L15xxE, Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="40"      m="12"/>
        <feature type="IOs"           n="115"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L152'  **************************** -->
      <subFamily DsubFamily="STM32L152">
        <feature type="VCC"           n="1.65"    m="3.60"/>
      
      <!-- *************************  Device 'STM32L152C6'  ***************************** -->
      <device Dname="STM32L152C6">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\CD00277537.pdf"             title="STM32L15xx6/8/B Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="36"/>
        <feature type="LCD"           n="1"       m="4.16"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
