t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
      <!-- *************************  Device 'STM32L152C8'  ***************************** -->
      <device Dname="STM32L152C8">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\CD00277537.pdf"             title="STM32L15xx6/8/B Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="36"/>
        <feature type="LCD"           n="1"       m="4.16"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152CB'  ***************************** -->
      <device Dname="STM32L152CB">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\CD00277537.pdf"             title="STM32L15xx6/8/B Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="36"/>
        <feature type="LCD"           n="1"       m="4.16"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152CC'  ***************************** -->
      <device Dname="STM32L152CC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MDP"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x2000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_256_OPT.FLM" start="0x1FF80000" size="0x0018"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00048356.pdf"             title="STM32L151xC, L152xC Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="21"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="LCD"           n="1"       m="4.18"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152QC'  ***************************** -->
      <device Dname="STM32L152QC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MDP"/>
        <debug      svd="SVD\STM32L15xC.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x2000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_256_OPT.FLM" start="0x1FF80000" size="0x0018"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00048356.pdf"             title="STM32L151xC, L152xC Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="39"      m="12"/>
        <feature type="IOs"           n="108"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="BGA"           n="132"/>
      </device>
      
      <!-- *************************  Device 'STM32L152QD'  ***************************** -->
      <device Dname="STM32L152QD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00034689.pdf"             title="STM32L151xD, L152xD Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="39"      m="12"/>
        <feature type="IOs"           n="108"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="BGA"           n="132"/>
      </device>
      
      <!-- *************************  Device 'STM32L152R6'  ***************************** -->
      <device Dname="STM32L152R6">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\CD00277537.pdf"             title="STM32L15xx6/8/B Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="20"      m="12"/>
        <feature type="IOs"           n="50"/>
        <feature type="LCD"           n="1"       m="4.32"/>
        <feature type="LCD"           n="1"       m="8.28"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="64"/>
        <feature type="BGA"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32L152R8'  ***************************** -->
      <device Dname="STM32L152R8">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\CD00277537.pdf"             title="STM32L15xx6/8/B Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="20"      m="12"/>
        <feature type="IOs"           n="50"/>
        <feature type="LCD"           n="1"       m="4.32"/>
        <feature type="LCD"           n="1"       m="8.28"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="64"/>
        <feature type="BGA"           n="64"/>
      </device>
      
