t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
      <!-- *************************  Device 'STM32L152VC'  ***************************** -->
      <device Dname="STM32L152VC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MDP"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x2000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_256_OPT.FLM" start="0x1FF80000" size="0x0018"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00048356.pdf"             title="STM32L151xC, L152xC Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="25"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32L152VD'  ***************************** -->
      <device Dname="STM32L152VD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00034689.pdf"             title="STM32L151xD, L152xD Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="25"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32L152ZC'  ***************************** -->
      <device Dname="STM32L152ZC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MDP"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x2000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_256_OPT.FLM" start="0x1FF80000" size="0x0018"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00048356.pdf"             title="STM32L151xC, L152xC Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="40"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32L152ZD'  ***************************** -->
      <device Dname="STM32L152ZD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <debug      svd="SVD\STM32L1xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00034689.pdf"             title="STM32L151xD, L152xD Data Sheet"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="ADC"           n="40"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="QFP"           n="144"/>
      </device>
      
