t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
      <!-- *************************  Device 'STM32L162RD'  ***************************** -->
      <device Dname="STM32L162RD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00039232.pdf"             title="STM32L162VD, ZD, QD, RD Data Sheet"/>
        <feature type="ADC"           n="21"      m="12"/>
        <feature type="IOs"           n="50"/>
        <feature type="LCD"           n="1"       m="4.32"/>
        <feature type="LCD"           n="1"       m="8.28"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
      </device>
      
      <!-- *************************  Device 'STM32L162VC'  ***************************** -->
      <device Dname="STM32L162VC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MDP"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x2000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_256_OPT.FLM" start="0x1FF80000" size="0x0018"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00049732.pdf"             title="STM32L162VC, RC Data Sheet"/>
        <feature type="ADC"           n="25"      m="12"/>
        <feature type="IOs"           n="83"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32L162VD'  ***************************** -->
      <device Dname="STM32L162VD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00039232.pdf"             title="STM32L162VD, ZD, QD, RD Data Sheet"/>
        <feature type="ADC"           n="25"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
      </device>
      
      <!-- *************************  Device 'STM32L162ZD'  ***************************** -->
      <device Dname="STM32L162ZD">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_HD"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_384.FLM"  start="0x08000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x3000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_384_OPT.FLM" start="0x1FF80000" size="0x0020"                 default="0"/>
        <book    name="Documents\CD00240193.pdf"             title="STM32L1xx Series Reference Manual"/>
        <book    name="Documents\DM00039232.pdf"             title="STM32L162VD, ZD, QD, RD Data Sheet"/>
        <feature type="ADC"           n="40"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
        <feature type="AnalogOther"   n="3"/>
        <feature type="USART"         n="5"       m="4000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="ExtBus"        n="1"/>
      </device>
      </subFamily>

