t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
      <!-- *************************  Device 'STM32L151VBxxA'  ***************************** -->
      <device Dname="STM32L151VBxxA">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L15xxxA.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="83"/>
        <feature type="LCD"           n="1"       m="4.44"/>
        <feature type="LCD"           n="1"       m="8.40"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L152xxA'  **************************** -->
      <subFamily DsubFamily="STM32L152xxA">
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="Timer"         n="2"       m="32"/>
        <feature type="SPI"           n="2"       m="16000000"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="VCC"           n="1.65"    m="3.60"/>
      
      <!-- *************************  Device 'STM32L152C6xxA'  ***************************** -->
      <device Dname="STM32L152C6xxA">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L15xxxA.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="LCD"           n="1"       m="4.18"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152C8xxA'  ***************************** -->
      <device Dname="STM32L152C8xxA">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L15xxxA.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="LCD"           n="1"       m="4.18"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152CBxxA'  ***************************** -->
      <device Dname="STM32L152CBxxA">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L15xxxA.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="LCD"           n="1"       m="4.18"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32L152R6xxA'  ***************************** -->
      <device Dname="STM32L152R6xxA">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
        <compile header="Device\Include\STM32L1xx.h"  define="STM32L1XX_MD"/>
        <debug      svd="SVD\STM32L15xxxA.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128.FLM"  start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x1000"              default="0"/>
        <algorithm  name="Flash\STM32L1xx_128_OPT.FLM" start="0x1FF80000" size="0x0010"                 default="0"/>
        <feature type="ADC"           n="20"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="LCD"           n="1"       m="4.32"/>
        <feature type="LCD"           n="1"       m="8.28"/>
        <feature type="QFP"           n="64"/>
        <feature type="BGA"           n="64"/>
      </device>
      
