t21/Walnut_X/Packages/.cache/Keil.STM32L1xx_DFP.1.0.2.pdsc
    <condition id="STM32L1_HD">
      <description>STMicroelectronics STM32L1 Series devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151QD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151RD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151VD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151ZD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152QD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152RD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152VD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152ZD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162QD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162RD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162VD"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162ZD"/>
    </condition>

    <condition id="STM32L1_MD">
      <description>STMicroelectronics STM32L1 Series devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L100C6"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L100R8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L100RB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151C6"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151C8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151CB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151R6"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151R8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151RB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151V8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151VB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152C6"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152C8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152CB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152R6"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152R8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152RB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152V8"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152VB"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L15???xxA"/>
    </condition>
    <condition id="STM32L1_MDP">
      <description>STMicroelectronics STM32L1 Series devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L100RC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151QC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151RC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151VC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151ZC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152QC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152RC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152VC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152ZC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151CC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L151UC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L152CC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162RC"/>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L162VC"/>
    </condition>

    <condition id="STM32L1_MD_MDP">
      <description>STMicroelectronics STM32L1 Series devices</description>
      <accept condition="STM32L1_MD"/>
      <accept condition="STM32L1_MDP"/>
    </condition>

    <condition id="STM32L1 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>STMicroelectronics STM32L1 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L1*"/>
    </condition>

  </conditions>

  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32L-Discovery\Blinky">
      <description>Blinky example</description>
      <board name="STM32L-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32L-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32L-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L1 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32L1 Series</description>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32L1xx_MD_OPT.s"       attr="template"  select="Flash Option Bytes Template"   condition="STM32L1_MD"/>
        <file category="source" name="Device\Source\ARM\STM32L1xx_MD+_OPT.s"      attr="template"  select="Flash Option Bytes Template"   condition="STM32L1_MDP"/>
        <file category="source" name="Device\Source\ARM\STM32L1xx_HD_OPT.s"       attr="template"  select="Flash Option Bytes Template"   condition="STM32L1_HD"/>
        <file category="source" name="Device\Source\ARM\STM32L1xx_XL_OPT.s"       attr="template"  select="Flash Option Bytes Template"   condition="STM32L1_XL"/>

        <!-- header files -->
        <file category="header" name="Device\Include\stm32l1xx.h"                                                                         condition="STM32L1" />

        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_stm32l1xx_xl.s"   attr="config"                                           condition="STM32L1_XL"  />
        <file category="source" name="Device\Source\ARM\startup_stm32l1xx_hd.s"   attr="config"                                           condition="STM32L1_HD"  />
        <file category="source" name="Device\Source\ARM\startup_stm32l1xx_md.s"   attr="config"                                           condition="STM32L1_MD"  />
        <file category="source" name="Device\Source\ARM\startup_stm32l1xx_mdp.s"  attr="config"                                           condition="STM32L1_MDP" />

        <!-- system file -->
        <file category="source" name="Device\Source\system_stm32l1xx.c"           attr="config"                                           condition="STM32L1"/>
        
      </files>
    </component>
    
  </components>
</package>
